{
    "work": [
        {
            "company": "Smart In Media AG",
            "title": "Software Engineer",
            "duration": "June 2020 – Ongoing . 3 yrs",
            "location": "Cologne, Germany",
            "content": [
                "Re-planned and implemented database models to achieve scalibility and better adaptation to modification",
                "Revamped the User experience to decrease information loss and increased robustness",
                "Introduced typescript in the solution for better maintainability, scalibility and error prevention",
                "Implemented containerization based deployment in CI/CD pipeline to increase availability in case of mishap",
                "First hand engaging with the client, understanding the requirements, proposing solutions, planning the timeline in Agile based software development"
            ]
        },
        {
            "company": "Colwiz ltd.",
            "title": "Software Engineer",
            "duration": "Jul 2013 – Sep 2016 . 3 yrs",
            "location": "Karachi, Pakistan",
            "content": [
                "Boost speed in generation of research author profiles by extending Apache Nutch plugin; creating data processing pipeline",
                "Develop, took ownership and release of Google Chrome's citations plugin on Google web store",
                "Assisted backend team by help implementing scheduling tasks on Java based microservice",
                "Scaled and improved text-search performance by deploying Apache SolrCloud on linux servers in distributed environemnt",
                "Revamped the obsolete flash-based application to the newer web technology which resulted in faster performance and better distribution"
            ]
        },
        {
            "company": "censhare AG",
            "title": "Working Student",
            "duration": "Oct 2018 – Mar 2020 . 1.5 yrs",
            "location": "Munich, Germany",
            "content": [
                "I designed and developed code and documentation sharing solution to support different teams within the organization for better coordination and collaboration",
                "Supporting the solution's development team in achieving the requirements of the client by working on product customization"
            ]
        },
        {
            "company": "top.legal",
            "title": "Working Student",
            "duration": "Feb 2018 – Aug 2018 . 7 mos",
            "location": "Munich, Germany",
            "content": [
                "increased accessability and assurance for customer onboarding process to easily publish their proposals by implementing graph like forms using React",
                "Worked closely with the CTO and participated in planning and designing the architecture of the new features"
            ]
        },
        {
            "company": "Motius GmbH",
            "title": "Working Student",
            "duration": "Aug 2018 – Oct 2018 . 3 mos",
            "location": "Munich, Germany",
            "content": [
                "I was a part of a data analysis project offered by Siemens to analyze traffic signal switching time in a team of four people and close contact with the client. We used serverless technology along with other Amazon web services, node.js and python."
            ]
        },
        {
            "company": "CRM Factory GmbH",
            "title": "Working student",
            "duration": "Jun 2017 – Feb 2018 . 9 mos",
            "location": "Munich, Germany",
            "content": [
                "My contribution to the company was via working on the integration of the main application component to the client businesses as a B2B service. I also helped in improving and supporting the product by Working along with a Senior Engineer."
            ]
        }
    ],
    "skills": [
        "Javascript",
        "Typescript",
        "React",
        "Redux",
        "Material UI",
        "Styled Components",
        "Node JS",
        "Express JS",
        "Jest",
        "Docker",
        "Git",
        "REST",
        "MySQL",
        "MongoDB",
        "Linux",
        "Nginx",
        "Azure DevOps",
        "AWS (S3 | Lambda | ECR | ECS)"
    ],
    "skillsSecondary": [
        "Java",
        "Python",
        "Go",
        "VBA",
        "Redis",
        "Hibernate",
        "Apache Nutch",
        "Apache Solr",
        "Google app script",
        "NestJS",
        "Angular 2+"
    ],
    "education": {
        "MS" : {
            "title": "MS Informatics",
            "duration": "2020",
            "uni": "Technical University of Munich",
            "image": "tum.jpeg"
        },
        "BS" : {
            "title": "BS Computer Science",
            "duration": "2013",
            "uni": "University of Karachi",
            "image": "uok.jpg",
            "size": "small"
        }
    },
    "projects" : [
        {
            "name": "Accommodate",
            "detail": "Matchmaking platform for Accommodation search where not only the tenant can search for accommodations rather Landlords can choose their tenants as well. Accommodate was the final project of the Web Applications Engineering Masters course. The project was developed from scratch including coming up with the business idea to business modeling, architecture designing, Development, deployment and presenting to the audience.",
            "githubLink": "https://github.com/AccommoDateApp"
        },
        {
            "name": "Lodge-In",
            "detail": "Lodge-in is an implementation of a prototype application feature for exploring Hotels and Lodging services using HERE Maps API, and booking them. The project demonstrates full-stack web application development with javascript technologies. Responsive front-end for both web and mobile devices implemented in React and Material UI, communicates with REST-based backend service written in Node.js, Express.js, Typescript and MongoDB. The project is bundled with Webpack and Dockerized for local installation and execution.",
            "githubLink": "https://github.com/m5khan/lodge-in",
            "webLink": "http://lodge-in.herokuapp.com"
        },
        {
            "name": "usp-web-viewer",
            "detail": "Urban Strategy Playground (USP) is a research group from the TUM Chair of Architectural Informatics aimed to develop methods and tools for detecting the potential for infill development in urban planning areas and development and verification of planning strategies on inner-city planning areas. This project was done as an Interdisciplinary project which uses the power of WebGL to visualize 3D models of the urban areas and the information interactively associated with them.",
            "githubLink": "https://github.com/m5khan/usp-web-viewer",
            "webLink": "https://usp-web-viewer.herokuapp.com/?model=objexamples/Project.zip"
        },
        {
            "name": "Post A Project for top.legal",
            "detail": "To facilitate clients in publishing their projects for which they are seeking legal assistance, I implemented a feature that asks clients a series of questions and modifies future questions based on the already selected prior inputs. I implemented the front-end in React along with defining the model of the questions and the interconnection between them in a data-structure.",
            "webLink": "https://app.top.legal/de/post-project"
        },
        {
            "name": "colwiz Citation Plugins for Google Documents",
            "detail": "Colwiz, now combined with Wizdom.ai is a research management solution that helps students and researchers in academia to manage their research work easily. I developed citation plugins for Google documents along with UX designers. One integrated to Colwiz's Google Chrome Extension and the other one as an independent add-on for Google Documents. The main challenges in this project were related to Google document manipulations and performance optimizations.",
            "webLink":"https://chrome.google.com/webstore/detail/wizdomai/djdocbgipfnggcpdejicpgjcaijcdlga?hl=en-US"
        }
    ] 
}