{
    "work": [
        {
            "company": "censhare AG",
            "title": "Working Student",
            "duration": "Oct 2018 – Mar 2020 . 1.5 yrs",
            "location": "Munich, Germany",
            "content": [
                "I was involved in supporting the solution's development team in achieving the requirements of the client by working on product customization. I also developed and took ownership of an in-house product; A code snippets management solution developed using Angular, Node.js and censhare Headless CMS for the internal team following complete SDCL."
            ]
        },
        {
            "company": "Motius GmbH",
            "title": "Working Student",
            "duration": "Aug 2018 – Oct 2020 . 3 mos",
            "location": "Munich, Germany",
            "content": [
                "I was a part of a data analysis project offered by Siemens to analyze traffic signal switching time in a team of four people and close contact with the client. We used serverless technology along with other Amazon web services, node.js and python."
            ]
        },
        {
            "company": "top.legal",
            "title": "Working Student",
            "duration": "Feb 2018 – Aug 2020 . 7 mos",
            "location": "Munich, Germany",
            "content": [
                "I Implemented a new feature to facilitate clients seeking legal assistance in publishing their projects effortlessly so they can be connected to the appropriate legal practitioner by working alongside co-founders in this legal-tech startup. I also participated in the architectural design of the features and implemented it using React, Node.js on AWS Lambda and MySQL."
            ]
        },
        {
            "company": "CRM Factory GmbH",
            "title": "Working student",
            "duration": "Jun 2017 – Feb 2018 . 9 mos",
            "location": "Munich, Germany",
            "content": [
                "My contribution to the company was via working on the integration of the main application component to the client businesses as a B2B service. I also helped in improving and supporting the product by Working along with a Senior Engineer."
            ]
        },
        {
            "company": "Colwiz ltd.",
            "title": "Software Engineer",
            "duration": "Jul 2013 – Sep 2016 . 3 yrs",
            "location": "Karachi, Pakistan",
            "content": [
                "Colwiz is a research management solution originated from the University of Oxford startup incubation program. I Worked on the product, mostly implementing front-end features in a team of Developers and UX Designers. I also Developed, took ownership and managed live releases of citations plugin for MS Word and Google Documents. Additionally, I worked on data accumulation and pre-processing to support the generation of Research Author profiles."
            ]
        }
    ],
    "skills": [
        "Javascript",
        "Typescript",
        "React",
        "Redux",
        "Angular 2+",
        "Angular JS",
        "Material UI",
        "Node JS",
        "Express JS",
        "HTML5",
        "CSS3",
        "Git",
        "REST",
        "Webpack",
        "MySQL",
        "MongoDB",
        "Docker",
        "Amazon Web Services"
    ],
    "skillsSecondary": [
        "Java",
        "Python",
        "C++",
        "VBA",
        "Redis",
        "Apache Nutch",
        "Apache Solr"
    ],
    "education": {
        "MS" : {
            "title": "MS Informatics",
            "duration": "oct 16 - Jan 20",
            "uni": "Technical University of Munich",
            "text": "Software Engineering, Machine Learning, Autonomous Driving, Computer Vision",
            "image": "tum.jpeg"
        },
        "BS" : {
            "title": "BS Computer Science",
            "duration": "Dec 09 - Dec 13",
            "uni": "University of Karachi",
            "text": "Algorithms and Data structures, Computer graphics, Software Engineering",
            "image": "uok.jpg",
            "size": "small"
        }
    },
    "projects" : [
        {
            "name": "Accommodate",
            "detail": "Matchmaking platform for Accommodation search where not only the tenant can search for accommodations rather Landlords can choose their tenants as well. Accommodate was the final project of the Web Applications Engineering Masters course. The project was developed from scratch including coming up with the business idea to business modeling, architecture designing, Development, deployment and presenting to the audience.",
            "githubLink": "https://github.com/AccommoDateApp"
        },
        {
            "name": "Lodge-In",
            "detail": "Lodge-in is an implementation of a prototype application feature for exploring Hotels and Lodging services using HERE Maps API, and booking them. The project demonstrates full-stack web application development with javascript technologies. Responsive front-end for both web and mobile devices implemented in React and Material UI, communicates with REST-based backend service written in Node.js, Express.js, Typescript and MongoDB. The project is bundled with Webpack and Dockerized for local installation and execution.",
            "githubLink": "https://github.com/m5khan/lodge-in",
            "webLink": "http://lodge-in.herokuapp.com"
        },
        {
            "name": "usp-web-viewer",
            "detail": "Urban Strategy Playground (USP) is a research group from the TUM Chair of Architectural Informatics aimed to develop methods and tools for detecting the potential for infill development in urban planning areas and development and verification of planning strategies on inner-city planning areas. This project was done as an Interdisciplinary project which uses the power of WebGL to visualize 3D models of the urban areas and the information interactively associated with them.",
            "githubLink": "https://github.com/m5khan/usp-web-viewer",
            "webLink": "https://usp-web-viewer.herokuapp.com/?model=objexamples/Project.zip"
        },
        {
            "name": "Post A Project for top.legal",
            "detail": "To facilitate clients in publishing their projects for which they are seeking legal assistance, I implemented a feature that asks clients a series of questions and modifies future questions based on the already selected prior inputs. I implemented the front-end in React along with defining the model of the questions and the interconnection between them in a data-structure.",
            "webLink": "https://app.top.legal/de/post-project"
        },
        {
            "name": "colwiz Citation Plugins for Google Documents",
            "detail": "Colwiz, now combined with Wizdom.ai is a research management solution that helps students and researchers in academia to manage their research work easily. I developed citation plugins for Google documents along with UX designers. One integrated to Colwiz's Google Chrome Extension and the other one as an independent add-on for Google Documents. The main challenges in this project were related to Google document manipulations and performance optimizations.",
            "webLink":"https://chrome.google.com/webstore/detail/wizdomai/djdocbgipfnggcpdejicpgjcaijcdlga?hl=en-US"
        }
    ] 
}