{
    "work": [
        {
            "company": "censhare AG",
            "title": "Working Student",
            "duration": "Oct 2018 - March 2020 (1.3 Years)",
            "location": "Munich, Germany",
            "content": [
                "Develop and took ownership of an in-house product; A code snippets management solution developed for internal team following complete SDCL. Web application development with angular 8, Node.js, typescript and censhare Headless CMS.",
                "Supporting the solution's development team in achieving the requirements of the client by working on product customization."
            ]
        },
        {
            "company": "Motius GmbH",
            "title": "Working Student",
            "duration": "Aug 2018 - Oct 2020 (3 Months)",
            "location": "Munich, Germany",
            "content": [
                "Data analysis project offered by Siemens. Analysis of traffic signal switching time in a team of four people and in close contact with the client. I joined this project from the mid unil the end using serverless technology with node.js and python."
            ]
        },
        {
            "company": "top.legal",
            "title": "Working Student",
            "duration": "Feb 2018 - Aug 2020 (7 Months)",
            "location": "Munich, Germany",
            "content": [
                "Working along with the Co-Founders of the young Legal-tech startup. Implemented a feature to facilitate clients seeking legal assistance in publishing their projects effortlessly so they can be connected to the appropriate legal practitioner.",
                "Full-stack Web Application Development with reactJS, AWS Lambda running node.js and MySql."
            ]
        },
        {
            "company": "CRM Factory GmbH",
            "title": "Working student",
            "duration": "June 2017 - Feb 2018 (9 Months)",
            "location": "Munich, Germany",
            "content": [
                "Integration of main application component to the client businesses as a B2B service.",
                "Improving and supporting the product by Working along with a Senior Engineer."
            ]
        },
        {
            "company": "Colwiz ltd.",
            "title": "Software Engineer",
            "duration": "July 2013 - Sept 2016 (3 Years)",
            "location": "Karachi, Pakistan",
            "content": [
                "colwiz was a research management solution originated from the University of Oxford startup incubation program.",
                "I Worked on the product, mostly implementing front-end features in team of Developers and UX Designers.",
                "Developed, took ownership and managed live releases of citations plugin for MS Office and google Documents.",
                "Data accumulation and pre-processing to support the generation of Research Author profiles."
            ]
        }
    ],
    "skills": [
        "Javascript",
        "Typescript",
        "React",
        "Redux",
        "Angular 2+",
        "Angular JS",
        "Material UI",
        "Node JS",
        "Express JS",
        "HTML5",
        "CSS3",
        "Git",
        "REST",
        "Webpack",
        "MySQL",
        "MongoDB",
        "Docker",
        "Amazon Web Services"
    ],
    "skillsSecondary": [
        "Java",
        "Python",
        "C++",
        "VBA",
        "Redis",
        "Apache Nutch",
        "Apache Solr"
    ],
    "education": {
        "MS" : {
            "title": "MS Informatics",
            "duration": "oct 16 - Jan 20",
            "uni": "Technical University of Munich",
            "text": "Software Engineering, Machine Learning, Autonomous Driving, Computer Vision",
            "image": "tum-logo.png"
        },
        "BS" : {
            "title": "BS Computer Science",
            "duration": "Dec 09 - Dec 13",
            "uni": "University of Karachi",
            "text": "Algorithms and Data structures, Computer graphics, Software Engineering",
            "image": "uok.jpg"
        }
    } 
}